In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['jassi','harry','correy','krish'],
    "marks" : [ 22,43,56,65],
    "city" : ['sahni','jalandhar','kapurthala','amritsar']
}

In [3]:
df = pd.DataFrame(dict1) #convert into excel form

In [4]:
df

     name  marks        city
0   jassi     22       sahni
1   harry     43   jalandhar
2  correy     56  kapurthala
3   krish     65    amritsar

In [5]:
#df.to_csv('friends.csv') # to create  csv file
#df.to_csv('friends1.csv', index = False) # to remove indexes in csv file

In [6]:
df.head(2) # to see first 2 rows

    name  marks       city
0  jassi     22      sahni
1  harry     43  jalandhar

In [7]:
df.tail(2) # to see last 2 rows

     name  marks        city
2  correy     56  kapurthala
3   krish     65    amritsar

In [8]:
df.describe() #it will print all various satistical terms related to numeric data

          marks
count   4.00000
mean   46.50000
std    18.66369
min    22.00000
25%    37.75000
50%    49.50000
75%    58.25000
max    65.00000

In [9]:
train = pd.read_csv('harry.csv') #to read csv file
train

   Train No.  Speed        City
0       1234     77       sahni
1       2134     44   jalandhar
2       3214     78  kapurthala
3       4123     88    amritsar

In [10]:
train['Speed'][0]=60

<ipython-input-10-682384cec6c2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0]=60

In [11]:
train

   Train No.  Speed        City
0       1234     60       sahni
1       2134     44   jalandhar
2       3214     78  kapurthala
3       4123     88    amritsar

In [12]:
#train.to_csv('train.csv')

In [13]:
train.index = ['first', 'second', 'third', 'fourth']

In [14]:
train

        Train No.  Speed        City
first        1234     60       sahni
second       2134     44   jalandhar
third        3214     78  kapurthala
fourth       4123     88    amritsar

# series and dataframe

In [15]:
ser = pd.Series(np.random.rand(34)) #it returns series with 34 indexs
ser

0     0.148227
1     0.422058
2     0.270398
3     0.546757
4     0.113249
5     0.549844
6     0.144457
7     0.041626
8     0.692676
9     0.444840
10    0.962751
11    0.953180
12    0.498061
13    0.987122
14    0.515259
15    0.314858
16    0.339976
17    0.685022
18    0.600120
19    0.806073
20    0.433768
21    0.061149
22    0.450480
23    0.850636
24    0.505059
25    0.707735
26    0.616833
27    0.002490
28    0.389302
29    0.133356
30    0.658614
31    0.322068
32    0.815478
33    0.531992
dtype: float64

In [16]:
newdf = pd.DataFrame(np.random.rand(300,5), index=np.arange(300)) #generate dataframe
newdf

            0         1         2         3         4
0    0.739330  0.541344  0.282757  0.355887  0.242061
1    0.512477  0.417910  0.750454  0.784221  0.281898
2    0.259005  0.223388  0.792922  0.809647  0.626480
3    0.567890  0.037207  0.180694  0.770608  0.903788
4    0.005456  0.792985  0.003262  0.853142  0.960395
..        ...       ...       ...       ...       ...
295  0.902302  0.040661  0.925852  0.575408  0.662738
296  0.638055  0.702151  0.347437  0.063435  0.799478
297  0.930845  0.358034  0.943083  0.436985  0.112557
298  0.963882  0.720529  0.556600  0.972934  0.991252
299  0.064735  0.724048  0.145026  0.360266  0.502431

[300 rows x 5 columns]

In [17]:
newdf.head()

          0         1         2         3         4
0  0.739330  0.541344  0.282757  0.355887  0.242061
1  0.512477  0.417910  0.750454  0.784221  0.281898
2  0.259005  0.223388  0.792922  0.809647  0.626480
3  0.567890  0.037207  0.180694  0.770608  0.903788
4  0.005456  0.792985  0.003262  0.853142  0.960395

In [18]:
newdf.tail()

            0         1         2         3         4
295  0.902302  0.040661  0.925852  0.575408  0.662738
296  0.638055  0.702151  0.347437  0.063435  0.799478
297  0.930845  0.358034  0.943083  0.436985  0.112557
298  0.963882  0.720529  0.556600  0.972934  0.991252
299  0.064735  0.724048  0.145026  0.360266  0.502431

In [19]:
type(newdf)

pandas.core.frame.DataFrame

In [20]:
newdf.describe()

                0           1           2           3           4
count  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.482573    0.484398    0.497487    0.516321    0.491571
std      0.290457    0.275852    0.305317    0.286393    0.305086
min      0.001422    0.000098    0.001348    0.005174    0.006943
25%      0.234589    0.235880    0.211816    0.268961    0.216974
50%      0.442548    0.478898    0.520781    0.529790    0.456359
75%      0.740789    0.710921    0.778615    0.769298    0.795984
max      0.999557    0.997558    0.992830    0.997153    0.993948

In [21]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
newdf.head()

          0         1         2         3         4
0  0.739330  0.541344  0.282757  0.355887  0.242061
1  0.512477  0.417910  0.750454  0.784221  0.281898
2  0.259005  0.223388  0.792922  0.809647  0.626480
3  0.567890  0.037207  0.180694  0.770608  0.903788
4  0.005456  0.792985  0.003262  0.853142  0.960395

In [23]:
newdf[0][0] = "harry"

In [24]:
newdf.head()

            0         1         2         3         4
0       harry  0.541344  0.282757  0.355887  0.242061
1    0.512477  0.417910  0.750454  0.784221  0.281898
2    0.259005  0.223388  0.792922  0.809647  0.626480
3     0.56789  0.037207  0.180694  0.770608  0.903788
4  0.00545641  0.792985  0.003262  0.853142  0.960395

In [25]:
newdf.dtype()

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [26]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf.head()

In [ ]:
newdf.index

In [ ]:
newdf.columns

In [ ]:
newdf.to_numpy() # to conversion

In [ ]:
newdf[0][0] = .5

In [ ]:
newdf.to_numpy()

In [ ]:
newdf.T

In [ ]:
newdf.head()

In [ ]:
newdf.sort_index(axis=0, ascending = False) # to sort into reverse order in rows

In [ ]:
newdf.sort_index(axis=1, ascending = False) #sort in the form of axis

In [ ]:
newdf.head()

In [ ]:
type(newdf[0])

In [ ]:
newdf2 = newdf #newdf2 act as a pointer changes we made in newdf2 will impliment in newdf

In [ ]:
newdf2[0][0] = 9783

In [ ]:
newdf

In [ ]:
newdf2 = newdf.copy() #it will generate the copy of newdf

In [ ]:
newdf2[0][0]=222

In [ ]:
newdf

In [ ]:
newdf.loc(0,0)=786

In [ ]:
newdf

In [ ]:
newdf.loc[0,0]= 786 # always use this method to assign values

In [ ]:
newdf

In [ ]:
newdf.colums = list('ABCDE')

In [ ]:
newdf

In [ ]:
newdf.columns = list("ABCDE")

In [ ]:
newdf

In [ ]:
#newdf.loc[0,0]=45

In [ ]:
newdf

In [ ]:
newdf.loc[0,'A']=5

In [ ]:
newdf

In [ ]:
newdf=newdf.drop(0,axis=1) #to drop 0 columns

In [ ]:
newdf

In [ ]:
newdf.loc[[1,2], ['C','D']]

In [ ]:
newdf.loc[[1,2],:] #it will return all the columns with two rows(1,2)

In [ ]:
newdf.loc[(newdf['A']<0.1)]

In [ ]:
newdf.loc[(newdf['B']<0.1)]

In [ ]:
newdf.loc[(newdf['B']<0.1) &(newdf['C']>.2)]

In [27]:
newdf.head()

            0         1         2         3         4
0       harry  0.541344  0.282757  0.355887  0.242061
1    0.512477  0.417910  0.750454  0.784221  0.281898
2    0.259005  0.223388  0.792922  0.809647  0.626480
3     0.56789  0.037207  0.180694  0.770608  0.903788
4  0.00545641  0.792985  0.003262  0.853142  0.960395

In [28]:
newdf.iloc[0,4] #it return the sum of 0 row's 4 values

0.24206129868070692

In [29]:
newdf.iloc[[0,2],[1,2]] #to acess values with indexes with no.

          1         2
0  0.541344  0.282757
2  0.223388  0.792922

In [30]:
newdf.head(3)

          0         1         2         3         4
0     harry  0.541344  0.282757  0.355887  0.242061
1  0.512477  0.417910  0.750454  0.784221  0.281898
2  0.259005  0.223388  0.792922  0.809647  0.626480

In [31]:
newdf.drop([0])

              0         1         2         3         4
1      0.512477  0.417910  0.750454  0.784221  0.281898
2      0.259005  0.223388  0.792922  0.809647  0.626480
3       0.56789  0.037207  0.180694  0.770608  0.903788
4    0.00545641  0.792985  0.003262  0.853142  0.960395
5      0.735542  0.747966  0.749527  0.938968  0.859039
..          ...       ...       ...       ...       ...
295    0.902302  0.040661  0.925852  0.575408  0.662738
296    0.638055  0.702151  0.347437  0.063435  0.799478
297    0.930845  0.358034  0.943083  0.436985  0.112557
298    0.963882  0.720529  0.556600  0.972934  0.991252
299   0.0647355  0.724048  0.145026  0.360266  0.502431

[299 rows x 5 columns]

In [32]:
newdf.drop([1],axis = 1)

              0         2         3         4
0         harry  0.282757  0.355887  0.242061
1      0.512477  0.750454  0.784221  0.281898
2      0.259005  0.792922  0.809647  0.626480
3       0.56789  0.180694  0.770608  0.903788
4    0.00545641  0.003262  0.853142  0.960395
..          ...       ...       ...       ...
295    0.902302  0.925852  0.575408  0.662738
296    0.638055  0.347437  0.063435  0.799478
297    0.930845  0.943083  0.436985  0.112557
298    0.963882  0.556600  0.972934  0.991252
299   0.0647355  0.145026  0.360266  0.502431

[300 rows x 4 columns]

In [36]:
newdf.rename(columns = {"0" : "A", "2": "B", "3" : "C", "4":"D"}, inplace = True)

In [40]:
newdf.columns = list("ABCDE")
newdf

              A         B         C         D         E
0         harry  0.541344  0.282757  0.355887  0.242061
1      0.512477  0.417910  0.750454  0.784221  0.281898
2      0.259005  0.223388  0.792922  0.809647  0.626480
3       0.56789  0.037207  0.180694  0.770608  0.903788
4    0.00545641  0.792985  0.003262  0.853142  0.960395
..          ...       ...       ...       ...       ...
295    0.902302  0.040661  0.925852  0.575408  0.662738
296    0.638055  0.702151  0.347437  0.063435  0.799478
297    0.930845  0.358034  0.943083  0.436985  0.112557
298    0.963882  0.720529  0.556600  0.972934  0.991252
299   0.0647355  0.724048  0.145026  0.360266  0.502431

[300 rows x 5 columns]

In [41]:
newdf.drop(['A','D'],axis=1, inplace = True) #it will drop permanently 'A' & 'D' from df

In [42]:
newdf

            B         C         E
0    0.541344  0.282757  0.242061
1    0.417910  0.750454  0.281898
2    0.223388  0.792922  0.626480
3    0.037207  0.180694  0.903788
4    0.792985  0.003262  0.960395
..        ...       ...       ...
295  0.040661  0.925852  0.662738
296  0.702151  0.347437  0.799478
297  0.358034  0.943083  0.112557
298  0.720529  0.556600  0.991252
299  0.724048  0.145026  0.502431

[300 rows x 3 columns]

In [47]:
newdf.reset_index(drop = True, inplace = True) #to reset index

In [48]:
newdf.head()

          B         C         E
0  0.541344  0.282757  0.242061
1  0.417910  0.750454  0.281898
2  0.223388  0.792922  0.626480
3  0.037207  0.180694  0.903788
4  0.792985  0.003262  0.960395

In [52]:
newdf.rename(columns= {"B": "A","C":"B","E":"C"}, inplace= True)

In [53]:
newdf

            A         B         C
0    0.541344  0.282757  0.242061
1    0.417910  0.750454  0.281898
2    0.223388  0.792922  0.626480
3    0.037207  0.180694  0.903788
4    0.792985  0.003262  0.960395
..        ...       ...       ...
295  0.040661  0.925852  0.662738
296  0.702151  0.347437  0.799478
297  0.358034  0.943083  0.112557
298  0.720529  0.556600  0.991252
299  0.724048  0.145026  0.502431

[300 rows x 3 columns]

In [57]:
newdf['A'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
295    False
296    False
297    False
298    False
299    False
Name: A, Length: 300, dtype: bool

In [58]:
newdf['A'] = None #to set all the values of A into None

In [59]:
newdf

        A         B         C
0    None  0.282757  0.242061
1    None  0.750454  0.281898
2    None  0.792922  0.626480
3    None  0.180694  0.903788
4    None  0.003262  0.960395
..    ...       ...       ...
295  None  0.925852  0.662738
296  None  0.347437  0.799478
297  None  0.943083  0.112557
298  None  0.556600  0.991252
299  None  0.145026  0.502431

[300 rows x 3 columns]

In [60]:
newdf.loc[:, ['B']] = 50 #to set values

In [61]:
newdf

        A   B         C
0    None  50  0.242061
1    None  50  0.281898
2    None  50  0.626480
3    None  50  0.903788
4    None  50  0.960395
..    ...  ..       ...
295  None  50  0.662738
296  None  50  0.799478
297  None  50  0.112557
298  None  50  0.991252
299  None  50  0.502431

[300 rows x 3 columns]

In [62]:
newdf.head()

      A   B         C
0  None  50  0.242061
1  None  50  0.281898
2  None  50  0.626480
3  None  50  0.903788
4  None  50  0.960395

In [63]:
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000]
        }

df = pd.DataFrame(cars, columns = ['Brand', 'Price'])

In [64]:
cars

{'Brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
 'Price': [22000, 25000, 27000, 35000]}

In [65]:
cars.head()

AttributeError: 'dict' object has no attribute 'head'